Documents/АрендаИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>АрендаИнструмента</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Инструмент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Инструменты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Инструменты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Стоимость</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыАренды</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыАренды</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

AccumulationRegisters/АрендыИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>АрендыИнструментов</Name>
    <RegisterType>Turnover</RegisterType>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>Инструмент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Инструменты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Инструменты</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Dimension>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Dimension>
      <Name>Филиал</Name>
      <ValueType><v8:Type>cfg:EnumRef.Филиалы</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.Филиалы</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Resource>
      <Name>Стоимость</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

    <Resource>
      <Name>КоличествоЧасов</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыИнструмента</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Доступен</Name>
    </Value>
    <Value>
      <Name>Забронирован</Name>
    </Value>
    <Value>
      <Name>ВРемонте</Name>
    </Value>
    <Value>
      <Name>Списан</Name>
    </Value>
  </Properties>
</MetaDataObject>

Enums/ВидыОперацийОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>ВидыОперацийОплат</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>ПокупкаАбонемента</Name>
    </Value>
    <Value>
      <Name>РазовоеЗанятие</Name>
    </Value>
    <Value>
      <Name>Продление</Name>
    </Value>
    <Value>
      <Name>ДополнительнаяУслуга</Name>
    </Value>
    <Value>
      <Name>Возврат</Name>
    </Value>
  </Properties>
</MetaDataObject>

Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Оплата</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаОплаты</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Сумма</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СпособОплаты</Name>
      <ValueType><v8:Type>cfg:CatalogRef.СпособыОплаты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.СпособыОплаты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Назначение</Name>
      <ValueType><v8:Type>cfg:EnumRef.ВидыОперацийОплат</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ВидыОперацийОплат</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Абонемент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Documents/АрендаИнструмента/Ext/ObjectModule.bsl
// Модуль документа Аренда инструмента

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Контроль доступности инструмента на выбранный период
	Если НЕ КонтрольКонфликтовРасписания.ПроверитьДоступностьИнструмента(Инструмент, ВремяНачала, ВремяОкончания, Ссылка) Тогда
		ВызватьИсключение "Невозможно провести аренду: инструмент недоступен в выбранный период.";
	КонецЕсли;

	// Движение по регистру АрендыИнструментов (учёт выручки и часов аренды)
	НаборЗаписей = РегистрыНакопления.АрендыИнструментов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Записать();

	Движение = НаборЗаписей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Инструмент = Инструмент;
	Движение.Клиент = Клиент;
	Движение.Филиал = Инструмент.Филиал;
	Движение.Стоимость = Стоимость;
	Движение.КоличествоЧасов = Цел((ВремяОкончания - ВремяНачала) / 3600);

	НаборЗаписей.Записать();

	// Помечаем инструмент как забронированный
	ИнструментОбъект = Инструмент.ПолучитьОбъект();
	ИнструментОбъект.Статус = Перечисления.СтатусыИнструмента.Забронирован;
	ИнструментОбъект.Записать();

	// Регистрация оплаты аренды
	Оплата = Документы.Оплата.СоздатьДокумент();
	Оплата.Дата = ТекущаяДата();
	Оплата.Клиент = Клиент;
	Оплата.Сумма = Стоимость;
	Оплата.Назначение = Перечисления.ВидыОперацийОплат.ДополнительнаяУслуга;
	Оплата.Комментарий = "Аренда инструмента: " + Строка(Инструмент);
	Оплата.Записать(РежимЗаписиДокумента.Проведение);

	АудитДействий.ЗарегистрироватьИзменение(ЭтотОбъект, "Аренда инструмента", "", Строка(Инструмент) + ", сумма=" + Строка(Стоимость));
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустоеЗначение(Клиент) Тогда
		Сообщить("Не заполнен клиент");
		Отказ = Истина;
	КонецЕсли;
	Если ПустоеЗначение(Инструмент) Тогда
		Сообщить("Не выбран инструмент");
		Отказ = Истина;
	КонецЕсли;
	Если ВремяОкончания <= ВремяНачала Тогда
		Сообщить("Время окончания должно быть позже времени начала");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
